Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི་བྱས་པ་རྟོགས་པའི་ས་ལ་གནས་པ་རྣམས་ཏེ། བྱས་པ་རྟོགས་པའི་ས་ལས་བྱུང་བ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མ་ཡིན་ནོ།
en: If you ask why, those who are established on the level of spiritual achievement have originated from the bodhisattvas, but it is not the case that bodhisattva great beings have originated from the level of spiritual achievement. “

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་བྱས་པ་རྟོགས་པའི་ས་ལ་གནས་པར་གྱུར་པ་ལྟ་ཞོག་གི །
en: Leave aside all the beings of the world system of the great trichiliocosm who have been established on the level of spiritual achievement!

source: གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་གྱུར་ཀྱང་དེ་དག་གི་བསོད་ནམས་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པའི་བསོད་ནམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་།
en: Even if all the beings of the world system of the great trichiliocosm were established on the level of the pratyekabuddhas, their merit would come nowhere near even a hundredth part of the merit of bodhisattvas who have initially set their minds on enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི། རང་སངས་རྒྱས་རྣམས་ཏེ། རང་སངས་རྒྱས་ལས་བྱུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མ་ཡིན་ནོ།
en: If you ask why, the pratyekabuddhas have originated from the bodhisattvas, but it is not the case that bodhisattva great beings have originated from the pratyekabuddhas. “

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་གྱུར་པ་ལྟ་ཞོག་གི །
en: Leave aside all the beings of the world system of the great trichiliocosm who have been established on the level of the pratyekabuddhas!

source: གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཀྱང་། དེ་དག་གི་བསོད་ནམས་དེས་བྱང་ཆུབ་སེམས་དཔའ་རང་བྱང་ཆུབ་ཏུ་ཞུགས་པའི་བསོད་ནམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་།
en: Even if all the beings of the world system of the great trichiliocosm had entered into the maturity of the bodhisattvas, their merit would come nowhere near even a hundredth part of the merit of bodhisattvas who have themselves set out for enlightenment.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་པ་ལྟ་ཞོག་གི །
en: Leave aside all the beings of the world system of the great trichiliocosm who have entered into the maturity of the bodhisattvas! {Ki.

source: གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཞུགས་པར་གྱུར་ཀྱང་། དེ་དག་གི་བསོད་ནམས་དེས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བསོད་ནམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་།
en: V: 135} Even if all the beings of the world system of the great trichiliocosm had set out for enlightenment, their merit would come nowhere near even a hundredth part of the merit of the tathāgatas, arhats, completely awakened buddhas.

source: །གྲངས་སུ་ཡང་མི་བཟོད།
en: It would not even match it in any number.

source: ཆར་ཡང་མི་བཟོད།
en: It would not even match it in any fraction.

source: བགྲང་བར་ཡང་མི་བཟོད།
en: It would not even match it in any categorization.

source: དཔེར་ཡང་མི་བཟོད།
en: It would not even match it in any comparison.

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པས་ཅི་ཡིད་ལ་བགྱི།
en: Blessed Lord, on what should bodhisattva great beings who have initially set their minds on enlightenment focus their attention?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱའོ། །གསོལ་པ།
en: They should focus their attention on all-aspect omniscience,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དངོས་པོ་ཇི་ལྟ་བུ་ཞིག་མཆིས་དམིགས་པ་ཇི་ལྟ་བུ་ཞིག་མཆིས་དབང་སྒྱུར་བ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Blessed Lord, what is the entity of all-aspect omniscience? What is its reference? What is its predominant condition?

source: རྣམ་པ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: What is its principle?

source: མཚན་ཉིད་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: What is its defining characteristic?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་ནི། དངོས་པོ་མེད་པ་མཚན་ཉིད་མེད་པ།
en: Subhūti,” replied the Blessed One, “that which is called all-aspect omniscience is without entity; it is without defining characteristics.

source: མཚན་མ་མེད་པ། བྱེད་པ་མེད་པ། སྐྱེ་བ་མེད་པ། འབྱུང་བ་མེད་པ་སྟེ།
en: It is signless, effortless, nonarising, and unoriginated.

source: རབ་འབྱོར་གང་ཡང་འདི་སྐད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དམིགས་པ་ཇི་ལྟ་བུ་ཞིག་ཡོད་ཅེས་ཟེར་བ་ནི།
en: Subhūti, you also asked, ‘What is the reference of all-aspect omniscience?’

source: རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དམིགས་པ་མེད་པ་སྟེ།
en: Subhūti, all-aspect omniscience is without apprehending.

source: དྲན་པས་དབང་བསྒྱུར་བ་དང་།
en: Mindfulness is its predominant condition.

source: ཞི་བའི་རྣམ་པ་མཚན་ཉིད་མེད་པ་ཡིན་ཏེ།
en: Peace is its principle, and it is without defining characteristics.

source: རབ་འབྱོར་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དམིགས་པའོ།
en: Subhūti, this is the reference of all-aspect omniscience.

source: །འདི་ནི་དབང་བསྒྱུར་བའོ།
en: This is its predominant condition.

source: །འདི་ནི་རྣམ་པའོ།
en: This is its principle.

source: །འདི་ནི་མཚན་ཉིད་དོ། །གསོལ་པ།
en: This is its defining characteristic.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབའ་ཞིག་དངོས་པོ་མ་མཆིས་པ་ལགས་སམ། མ་ལགས་ཀྱི།
en: Blessed Lord, is all-aspect omniscience exclusively a nonentity or is it not?

source: གཟུགས་ཀྱང་དངོས་པོ་མ་མཆིས་པ་ལགས།
en: Are physical forms also nonentities?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་དངོས་པོ་མ་མཆིས་པ་ལགས།
en: Are feelings, perceptions, formative predispositions, and consciousness also nonentities?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་དངོས་པོ་མ་མཆིས་པ་ལགས། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Are the sense fields, the sensory elements, and the links of dependent origination also nonentities?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་དངོས་པོ་མ་མཆིས་པ་ལགས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Are all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment also nonentities?

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་དངོས་པོ་མ་མཆིས་པ་ལགས།
en: Are the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas also nonentities?

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ཡང་དངོས་པོ་མ་མཆིས་པ་ལགས།
en: Are great loving kindness, great compassion, great empathetic joy, and great equanimity also nonentities?

source: འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཀྱང་དངོས་པོ་མ་མཆིས་པ་ལགས།
en: Are conditioned elements and unconditioned elements also nonentities?” {Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དངོས་པོ་མེད་པའོ།
en: V: 136} “Subhūti,” replied the Blessed One, “all-aspect omniscience is indeed a nonentity.

source: །གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡང་དངོས་པོ་མེད་པའོ།
en: Physical forms, feelings, perceptions, formative predispositions, and consciousness are also nonentities.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་དངོས་པོ་མེད་པའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are also nonentities.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་དངོས་པོ་མེད་པའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are also nonentities.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་དངོས་པོ་མེད་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are also nonentities.

source: །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ཡང་དངོས་པོ་མེད་པའོ།
en: Great loving kindness, great compassion, great empathetic joy, and great equanimity are also nonentities.

source: །འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཁམས་ཀྱང་དངོས་པོ་མེད་པའོ།
en: Conditioned elements and unconditioned elements are also nonentities.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, Subhūti, it is because in all-aspect omniscience there is no essential nature.

source: རབ་འབྱོར་གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པའོ། །གསོལ་པ།
en: Subhūti, that in which there is no essential nature is a nonentity.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ངོ་བོ་ཉིད་མ་མཆིས་པ་ལགས།
en: Blessed Lord, why is all-aspect omniscience without essential nature?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདུས་པའི་ངོ་བོ་ཉིད་མེད་དེ།
en: Subhūti,” replied the Blessed One, “there is no conditioned essential nature.

source: གང་ལ་འདུས་པའི་ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: That in which there is no conditioned essential nature is a nonentity.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ།
en: For this reason, Subhūti, all phenomena have the essential nature of nonentity.

source: །རབ་འབྱོར་འདི་ལྟར་ཡང་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: Similarly, Subhūti, all phenomena also have the essential nature of emptiness.

source: །ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པའི་ངོ་བོ་ཉིད་དོ།
en: All phenomena have the essential nature of signlessness.

source: །ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པའི་ངོ་བོ་ཉིད་དོ།
en: All phenomena have the essential nature of wishlessness.

source: །རབ་འབྱོར་འདི་ལྟར་ཡང་ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: Similarly, Subhūti, all phenomena also have the essential nature of the real nature.

source: །ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་དོ།
en: All phenomena have the essential nature of the very limit of reality.

source: །ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: All phenomena have the essential nature of the realm of phenomena.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རིག་པར་བྱའོ། །གསོལ་པ།
en: For this reason, too, Subhūti, one should know that all phenomena have the essential nature of nonentity.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་གལ་ཏེ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ན། འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ཐབས་གང་དང་ལྡན་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས།
en: Blessed Lord, if all phenomena are of the essential nature of nonentity, in that case, with what skill in means do bodhisattva great beings who have initially set their minds on enlightenment refine the buddhafields and bring beings to maturity while practicing the perfection of generosity?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། བསམ་གཏན་དང་པོ་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?

source: བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། བྱམས་པ་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the first meditative concentration, the second meditative concentration, the third meditative concentration, and the fourth meditative concentration?

source: སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing loving kindness, compassion, empathetic joy, and equanimity?

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། ནང་སྟོང་པ་ཉིད་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception?

source: ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་ཅིང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path?

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: With what do they refine the buddhafields and bring beings to maturity while practicing the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: V: 137} the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, and [the goals], up to and including all-aspect omniscience?” “

source: རབ་འབྱོར་དེ་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་དང་། སེམས་ཅན་དེ་དག་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཤེས་པ་དེ་ཉིད། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Subhūti,” replied the Blessed One, “the skill in means of bodhisattva great beings is that they investigate all phenomena as having the essential nature of nonentity and that they refine the buddhafields and bring beings to maturity, while cognizing that those buddhafields and those beings also are of the essential nature of nonentity.

source: བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: They investigate the path of enlightenment while practicing the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ཅིང་། བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They investigate the path of enlightenment while practicing the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་ཅིང་། བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: They investigate the path of enlightenment while practicing the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: They investigate the path of enlightenment while practicing the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་སྤྱོད་ཅིང་། བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ཅིང་།
en: They investigate the path of enlightenment while practicing [the goals], up to and including all-aspect omniscience. “

source: བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །བྱང་ཆུབ་ཀྱི་ལམ་དེ་ཡང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རབ་ཏུ་ཤེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། ནམ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པར་མ་གྱུར་པ་དང་།
en: They know that the path of enlightenment is also of the essential nature of nonentity.

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པར་མ་གྱུར་པ་དེའི་བར་དུ།
en: That is to say, those bodhisattva great beings practice the six perfections and investigate that path of enlightenment until they acquire the ten powers of the tathāgatas, and until they acquire the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, and all-aspect omniscience.

source: བྱང་ཆུབ་ཀྱི་ལམ་དེ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ། །རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྟེ།
en: That, Subhūti, is the path of the bodhisattvas.

source: ལམ་དེ་ལ་གནས་ཤིང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Abiding on that path, they investigate all the perfections.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Having investigated all the perfections, they will, through the wisdom of a single instant, attain all-aspect omniscience.

source: །དེའི་ཚེ་དེའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་མི་སྐྱེ་བར་སྤང་བས་ཡོངས་སུ་སྤོང་བར་འགྱུར་ཏེ།
en: At that time, they will also cast off all afflicted mental states associated with reincarnation through the continuity of propensities, abandoning them so that they will not recur.

source: དེ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལ་རྣམ་པར་ལྟ་ན། དངོས་པོ་མེད་པར་ཡང་མི་དམིགས་ན། དངོས་པོ་ཡོད་པར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: When they observe the world system of the great trichiliocosm with the buddha eye, since they do not even apprehend nonentities, what need one say about entities! “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། དེ་ལྟར་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཡང་། མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ་དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, they dispense gifts, and although they do dispense gifts in that way, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: །ལེན་པ་ལ་ཡང་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ།
en: Also, as far as the giver is concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: །གཏོང་བ་ལ་ཡང་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། །དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡིད་ལ་མི་བྱེད་དོ།
en: And as far as the recipient is concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: །བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་མི་དམིགས་ཏེ།
en: They do not even apprehend the mind of enlightenment.

source: མཚན་མར་མི་བྱེད་ཡུལ་དུ་མི་བྱེད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: They do not conceptualize it, they do not objectify it, and they do not observe it. {

source: བཟོད་པ་སྒོམ། བརྩོན་འགྲུས་རྩོམ། བསམ་གཏན་ལ་གོམས་པར་བྱེད། ཤེས་རབ་སྒོམ་སྟེ། དེ་ལྟར་ཤེས་རབ་སྒོམ་ཡང་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ།
en: V: 138} “When they practice the perfection of wisdom, they maintain ethical discipline, they cultivate tolerance, they undertake perseverance, they experience meditative concentration, and they cultivate wisdom, and although they do cultivate wisdom [and so forth] in that way, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ། །གང་ཤེས་རབ་དེ་ལ་སྒོམ་པ་དེ་ཡང་། མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ།
en: Also, as far as the one who cultivates that wisdom is concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.
